<?php

return [
	// general words
	'ops' => 'أُووبس...',
	'btn_text' => 'حسناً',

	// single action alerts
	'users' => [
		'confirm' => [
			'delete' => [
				'title' => 'تم الحذف!',
				'text' => 'هل تريد حقًا حذف هذا العنصر!',
				'yes' => 'نعم احذفه',
			],
			'restore' => [
				'title' => 'تمت الاستعادة!',
				'text' => 'هل تريد حقاً استعادة هذا العنصر',
				'yes' => 'نعم, استعده',
			],
			'title' => 'هل أنت متأكد؟',
			'no' => 'لا ، ألغي!'
		],
		'cancel' => [
			'title' => 'تم الإلغاء',
			'delete' => [
				'text' => 'العنصر الخاصة بك آمن :)'
			],
			'restore' => [
				'text' => 'لم يتم استعادة العنصر :(',
			],
		],
		'request' => [
			'before_sent_title' => 'الرجاء الانتظار',
			'before_sent_text' => 'البيانات التي أرسلتها قيد المعالجة ، يرجى التحلي بالصبر!',
			'image_size' => 'حجم الصورة أكثر من 1 ميغا بايت! الرجاء اختيار صورة أخرى',
			'image_type' => 'الرجاء تحديد صورة بالتنسيق: JPEG ، JPG ، PNG',
		],
		'response' => [
			'create' => 'تم انشاء المستخدم بنجاح',
			'update' => 'تم تحديث البيانات بنجاح!',
			'logout_other_devices' => 'تم تسجيل الخروج من الأجهزة الأخرى بنجاح',
			'confirm_password' => 'كلمة المرور المقدمة لا تتطابق مع كلمة المرور الحالية!',
			'delete' => [
				'title' => 'تم الحذف',
				'text' => 'تم حذف المستخدم بنجاح!',
			],
			'restore' => [
				'title' => 'تمت الاستعادة',
				'text' => 'تمت استعادة المستخدم بنجاح!',
			],
			'errors' => [
				'not_allowed' => 'غير مسموح لك بحذف حسابك!',
				'not_exist' => 'المستخدم غير موجود!',
				'unknown' => 'هنالك خطأ!',
			]
		]
	]
];
