<?php

return [
	// general words
	'ops' => 'أُووبس...',
	'btn_text' => 'حسناً',

	// Global Errors
	'errors' => [
		'unknown' => 'هنالك خطأ!',
		'no_permissions' => 'ليس لديك الأذونات الصحيحة!',
	],

	'confirm' => [
		'delete' => [
			'title' => 'تم الحذف!',
			'text' => 'هل تريد حقًا حذف هذا العنصر!',
			'yes' => 'نعم احذفه',
		],
		'restore' => [
			'title' => 'تمت الاستعادة!',
			'text' => 'هل تريد حقاً استعادة هذا العنصر',
			'yes' => 'نعم, استعده',
		],
		'title' => 'هل أنت متأكد؟',
		'no' => 'لا ، ألغي!'
	],

	'cancel' => [
		'title' => 'تم الإلغاء',
		'delete' => [
			'text' => 'العنصر الخاصة بك آمن :)'
		],
		'restore' => [
			'text' => 'لم يتم استعادة العنصر :(',
		],
	],

	'request' => [
		'before_sent_title' => 'الرجاء الانتظار',
		'before_sent_text' => 'البيانات التي أرسلتها قيد المعالجة ، يرجى التحلي بالصبر!',
		'image_size' => 'حجم الصورة أكثر من 1 ميغا بايت! الرجاء اختيار صورة أخرى',
		'image_type' => 'الرجاء تحديد صورة بالتنسيق: JPEG ، JPG ، PNG',
	],

	// single action alerts
	'users' => [
		'response' => [
			'create' => 'تم انشاء المستخدم بنجاح',
			'update' => 'تم تحديث المستخدم بنجاح!',
			'logout_other_devices' => 'تم تسجيل الخروج من الأجهزة الأخرى بنجاح',
			'confirm_password' => 'كلمة المرور المقدمة لا تتطابق مع كلمة المرور الحالية!',
			'delete' => [
				'title' => 'تم الحذف',
				'text' => 'تم حذف المستخدم بنجاح!',
			],
			'restore' => [
				'title' => 'تمت الاستعادة',
				'text' => 'تمت استعادة المستخدم بنجاح!',
			],
			'errors' => [
				'not_allowed' => 'غير مسموح لك بحذف حسابك!',
				'not_exist' => 'المستخدم غير موجود!',
			]
		]
	],
	'roles' => [
		'response' => [
			'create' => 'تم انشاء الدور بنجاح',
			'update' => 'تم تحديث الدور بنجاح!',
			'delete' => [
				'title' => 'تم الحذف',
				'text' => 'تم حذف الدور بنجاح!',
			],
			'restore' => [
				'title' => 'تمت الاستعادة',
				'text' => 'تمت استعادة الدور بنجاح!',
			],
			'errors' => [
				'not_exist' => 'الدور غير موجود!',
			]
		]
	],
	'langs' => [
		'response' => [
			'create' => 'تم انشاء اللغة بنجاح',
			'update' => 'تم تحديث اللغة بنجاح!',
			'delete' => [
				'title' => 'تم الحذف',
				'text' => 'تم حذف اللغة بنجاح!',
			],
			'restore' => [
				'title' => 'تمت الاستعادة',
				'text' => 'تمت استعادة اللغة بنجاح!',
			],
			'errors' => [
				'not_exist' => 'اللغة غير موجود!',
			]
		]
	],

	'settings' => [
		'response' => [
			'success' => 'تم تحديث الإعدادات بنجاح!'
		]
	]
];
