<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during authentication for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */

    'failed' => 'بيانات الاعتماد هذه لا تطابق سجلاتنا.',
    'inactive' => 'حسابك غير نشط. يرجى التواصل مع المسؤول.',
    'blocked' => 'تم حظر حسابك.',
    'password' => 'كلمة المرور المقدمة غير صحيحة.',
    'throttle' => 'محاولات تسجيل دخول كثيرة جدًا. يرجى المحاولة مرة أخرى خلال :seconds ثواني.',
	'verification-link-sent' => 'تم إرسال رابط التحقق ، يرجى التحقق من بريدك الإلكتروني.',

	'pages' => [
		'login' => [
			'intro' => 'أهلاً بعودتك',
			'title' => 'تسجيل الدخول',
			'sub_title' => 'مرحبًا بعودتك! يرجى تسجيل الدخول إلى حسابك والاستمرار في تنمية متجرك.',
		],
		'forget' => [
			'intro' => 'إستعادة الحساب',
			'title' => 'نسيت كلمة المرور؟',
			'sub_title' => 'أدخل بريدك الإلكتروني وسنرسل لك تعليمات لإعادة تعيين كلمة مرورك.',
		],
		'restore' => [
			'intro' => 'إستعادة الحساب',
			'title' => 'إعادة تعيين كلمة المرور',
			'sub_title' => 'يجب أن تكون كلمة مرورك الجديدة مختلفة عن كلمات المرور المستخدمة سابقًا.',
		],
		'two_factor_auth' => [
			'intro' => 'أهلاً بعودتك',
			'title' => 'التحقق بخطوتين',
			'code' => [
				'sub_title' => 'يرجى تأكيد الوصول إلى حسابك عن طريق إدخال رمز المصادقة المقدم من تطبيق المصادقة الخاص بك.',
			],
			'recovery' => [
				'sub_title' => 'يرجى تأكيد الوصول إلى حسابك عن طريق إدخال أحد رموز الاسترداد في حالات الطوارئ.',
			],
		],
		'confirm' => [
			'intro' => 'أمان الحساب',
			'title' => 'تأكيد كلمة المرور',
			'sub_title' => 'لأسباب أمنية يرجى تأكيد كلمة المرور الخاصة بك.',
		],
		'verify' => [
			'intro' => 'تفعيل الحساب',
			'title' => 'التحقق من البريد الإلكتروني',
			'sub_title' => 'يجب التحقق من عنوان بريدك الإلكتروني ، يرجى التحقق من بريدك الإلكتروني للحصول على رابط التحقق.',
		],
	]
];
