<?php

return [
	'search' => 'بحث:',
	'first_name' => 'الاسم الاول:',
	'last_name' => 'الاسم الأخير:',
	'email' => 'البريد الالكتروني:',
	'password' => 'كلمة المرور',
	'confirm_password' => 'تأكيد كلمة المرور:',
	'new_password' => 'كلمة المرور الجديدة:',
	'current_password' => 'كلمة المرور الحالية:',
	'forget_password' => 'نسيت كلمة المرور؟',
	'mobile' => 'الموبايل:',
	'birth_date' => 'تاريخ الميلاد:',
	'gender' => [
		'title' => 'الجنس:',
		'male' => 'ذكر',
		'female' => 'أنثى',
	],
	'role' => [
		'title' => 'الدور:',
		'no_roles' => 'لم يتم إنشاء أدوار!',
	],
	'status' => [
		'title' => 'حالة الحساب:',
		'not_verified' => 'غير مفعل',
		'verified' => 'مفعل',
		'blocked' => 'محظور',
	],
	'lang' => 'اللغة:',
	'profile_picture' => [
		'title' => 'صورة الحساب:',
		'sub' => "الأبعاد الموصى بها هي: 500x500",
	],
	'remember' => 'تذكرني',
	'code' => 'رمز المصادقة',
	'recovery_code' => 'رمز الاسترداد',
	'site_title' => 'عنوان الموقع:',
	'tagline' => [
		'title' => 'شرح قصير:',
		'sub' => 'في بضع كلمات ، اشرح ما يدور حوله هذا الموقع.',
	],
	'site_description' => 'وصف الموقع:',
	'site_url' => 'رابط الموقع:',
	'favicon' => [
		'title' => 'ايقونة الموقع:',
		'sub' => 'يجب أن تكون أيقونات الموقع مربعة وعلى الأقل 512×512 بكسل.',
	],
	'no_timezone' => 'لا توجد منطقة زمنية',
	'timezone' => 'المنطقة الزمنية:',
	'date_format' => 'تنسيق التاريخ:',
	'time_format' => 'تنسيق الوقت:',
	'custom' => 'مخصص',
	'utc_time' => 'التوقيت العالمي هو:',
	'server_time' => 'التوقيت المحلي هو:',
	'date_time_doc' => 'توثيق عن تنسيق التاريخ والوقت.',

	'logo' => 'الشعار:',
	'logo_width' => 'عرض الشعار:',
	'logo_height' => 'ارتفاع الشعار:',
	'mobile_logo' => 'شعار الموبايل:',
	'mobile_logo_width' => 'عرض شعار الموبايل:',
	'main_color' => 'اللون الاساسي:',
	'main_color_hover' => 'اللون الاساسي (تمرير):',
	'boxes_color' => 'لون الصناديق:',
	'bg_color' => 'لون الخلفية:',
	'active_bg_color' => 'لون الخلفية (مفعل):',
	'badge_color' => 'لون الشارة:',
	'text_color' => 'لون الخط:',

	'dark_logo' => 'الشعار (مظلم):',
	'dark_mobile_logo' => 'شعار الموبايل (مظلم):',
	'dark_main_color' => 'اللون الاساسي (مظلم):',
	'dark_main_color_hover' => 'اللون الاساسي (تمرير) (مظلم):',
	'dark_boxes_color' => 'لون الصناديق (مظلم):',
	'dark_bg_color' => 'لون الخلفية (مظلم):',
	'dark_active_bg_color' => 'لون الخلفية (مفعل) (مظلم):',
	'dark_badge_color' => 'لون الشارة (مظلم):',
	'dark_text_color' => 'لون الخط (مظلم):',

	'country' => 'البلد:',
	'select_country' => '-- اختر البلد --',
	'state' => 'المحافظة/المقاطعة:',
	'city' => 'المدينة:',
	'address' => [
		1 => [
			'title' => 'العنوان 1:',
			'placeholder' => 'اسم الشارع ورقم المنزل',
		],
		2 => [
			'title' => 'العنوان 2:',
			'placeholder' => 'شقة، جناح، وحدة الخ (اختياري)',
		]
	],
	'postcode' => 'الرمز البريدي:',

	'allow_reviews' => [
		'title' => 'السماح بالمراجعات؟',
		'tooltip' => 'حدد هذا إذا كنت تريد السماح بالمراجعات في متجرك.'
	],
	'allow_geust_reviews' => 'السماح بمراجعة الزوار؟',
	'allow_geust_checkout' => [
		'title' => 'السماح للزوار بالشراء؟',
		'tooltip' => 'حدد هذا إذا كنت تريد للزوار الشراء دون إنشاء حساب.'
	],
	'active_wishlist' => 'تفعيل قائمة الأمنيات؟',
	'active_compare' => 'تفعيل المقارنة؟',
	'allow_out_of_stock' => [
		'title' => 'عرض المنتجات غير المتوفرة؟',
		'tooltip' => 'حدد هذا إذا كنت تريد الاستمرار في عرض المنتجات غير المتوفرة في المخزون.'
	],
	'enable_social_share' => 'تمكين المشاركة الاجتماعية؟',
	'enable_share_on' => 'تمكين المشاركة على:',

	'active_recently_viewed' => [
		'title' => 'تفعيل تم عرضه مؤخرًا؟',
		'tooltip' => 'حدد هذا إذا كنت تريد إظهار قسم: تم عرضه مؤخرًا.',
	],
	'active_recommendations' => [
		'title' => 'تفعيل التوصيات؟',
		'tooltip' => 'حدد هذا إذا كنت تريد عرض قسم التوصيات في صفحة الشكر.'
	],
	'currency' => [
		'title' => 'العملة:',
		'tooltip' => 'ستكون هذه هي العملة الافتراضية لمتجرك.',
	],
	'currency_pos' => [
		'title' => 'مكان العملة:',
		'options' => [
			'left' => 'يسار',
			'right' => 'يمين',
			'left_space' => 'يسار مع مسافة',
			'right_space' => 'يمين مع مسافة',
		]
	],
	'thousand_sep' => 'فاصلة الألف:',
	'decimal_sep' => 'الفاصلة العشرية:',
	'decimals_num' => 'عدد الكسور العشرية:',
	'multi_currencies' => 'تفعيل العملات المتعددة؟',
	'currencies_display' => [
		'title' => 'عرض القائمة المنسدلة',
		'options' => [
			'full' => 'كامل [ United State Dollar ($) ]',
			'code' => 'اختصار [ USD ]',
			'symbol' => 'رمز [ $ ]',
			'code_symbol' => 'اختصار + رمز [ USD ($) ]',
		]
	],
	'choose_currencies' => [
		'title' => 'اختر العملات:',
		'tooltip' => 'اختر العملات التي تريد أن يدعمها متجرك.'
	],

	'email_from' => [
		'title' => '"من" الاسم:',
		'tooltip' => 'كيف يظهر اسم المرسل في رسائل البريد الإلكتروني الصادرة من متجرك.'
	],
	'email_address' => [
		'title' => '"من" العنوان:',
		'tooltip' => 'كيف يظهر البريد الإلكتروني للمرسل في رسائل البريد الإلكتروني الصادرة من متجرك.'
	],
	'email_main_color' => [
		'title' => 'اللون الرئيسي:',
		'tooltip' => 'اللون الأساسي لقوالب البريد الإلكتروني الخاصة بالمتجر. الافتراضي #2C2CCC.'
	],
	'email_bg_color' => [
		'title' => 'لون الخلفية:',
		'tooltip' => 'لون الخلفية لقوالب البريد الإلكتروني الخاصة بالمتجر. الافتراضي #F7F7F7.'
	],
	'email_body_bg_color' => [
		'title' => 'لون الصندوق:',
		'tooltip' => 'لون خلفية الصندوق. الافتراضي #FFFFFF.'
	],
	'email_text_color' => [
		'title' => 'لون النص:',
		'tooltip' => 'لون النص الاساسي. الافتراضي #333333.'
	],

	'email_rec' => [
		'users' => 'المستلمون هم مستخدمي المتجر',
		'customer' => 'المتلقي هو العميل',
	],
	'email_new_order' => [
		'title' => 'تم تقديم طلب جديد:',
		'tooltip' => 'إرسال البريد الإلكتروني عند تقديم طلب جديد.'
	],
	'email_out_stock' => [
		'title' => 'إنتهى من المخزن:',
		'tooltip' => 'أرسل بريدًا إلكترونيًا عندما يكون المنتج غير متوفر في المخزون'
	],
	'email_order_canceled' => [
		'title' => 'تم إلغاء الطلب:',
		'tooltip' => 'إرسال بريد إلكتروني عندما يقوم العميل بإلغاء الطلب'
	],
	'email_order_confirmed' => [
		'title' => 'تم تاكيد الطلب:',
		'tooltip' => 'إرسال البريد الإلكتروني تلقائيا بعد الشراء'
	],
	'email_order_shipped' => [
		'title' => 'تم شحن الطلب:',
		'tooltip' => 'إرسال البريد الإلكتروني تلقائيًا عندما يتم وضع علامة على الطلب على أنه تم شحنه'
	],
	'email_order_completed' => [
		'title' => 'تم اكتمال الطلب:',
		'tooltip' => 'يتم إرساله تلقائيًا عندما يتم وضع علامة على الطلب على أنه مكتمل'
	],
	'email_order_refunded' => [
		'title' => 'تم رد الطلب	:',
		'tooltip' => 'يتم إرساله تلقائيًا عند إصدار استرداد'
	],
	'send_to' => [
		'title' => 'ارسال إلى:',
		'tooltip' => 'المستلمون المخصصون: يجب عليك اختيار المستلمين من القائمة. المستلمون حسب الدور: سيتلقى جميع الأعضاء في الدور البريد الإلكتروني.',
		'options' => [
			'no' => 'اختر نوع',
			'custom' => 'مستلمون المخصصون',
			'by_role' => 'مستلمون حسب الدور',
		],
		'placeholder' => 'حدد المستلمين'
	],
];
