<?php

return [
	'first_name' => 'الاسم الاول:',
	'last_name' => 'الاسم الأخير:',
	'email' => 'البريد الالكتروني:',
	'password' => 'كلمة المرور',
	'confirm_password' => 'تأكيد كلمة المرور:',
	'new_password' => 'كلمة المرور الجديدة:',
	'current_password' => 'كلمة المرور الحالية:',
	'forget_password' => 'نسيت كلمة المرور؟',
	'mobile' => 'الموبايل:',
	'birth_date' => 'تاريخ الميلاد:',
	'gender' => [
		'title' => 'الجنس:',
		'male' => 'ذكر',
		'female' => 'أنثى',
	],
	'role' => [
		'title' => 'الدور:',
		'no_roles' => 'لم يتم إنشاء أدوار!',
	],
	'status' => [
		'title' => 'حالة الحساب:',
		'not_verified' => 'غير مفعل',
		'verified' => 'مفعل',
		'blocked' => 'محظور',
	],
	'lang' => 'اللغة:',
	'profile_picture' => [
		'title' => 'صورة الحساب:',
		'sub' => "الأبعاد الموصى بها هي: 500x500",
	],
	'remember' => 'تذكرني',
	'code' => 'رمز المصادقة',
	'recovery_code' => 'رمز الاسترداد',
	'site_title' => 'عنوان الموقع:',
	'tagline' => [
		'title' => 'شرح قصير:',
		'sub' => 'في بضع كلمات ، اشرح ما يدور حوله هذا الموقع.',
	],
	'site_description' => 'وصف الموقع:',
	'site_url' => 'رابط الموقع:',
	'favicon' => [
		'title' => 'ايقونة الموقع:',
		'sub' => 'يجب أن تكون أيقونات الموقع مربعة وعلى الأقل 512×512 بكسل.',
	],
	'no_timezone' => 'لا توجد منطقة زمنية',
	'timezone' => 'المنطقة الزمنية:',
	'date_format' => 'تنسيق التاريخ:',
	'time_format' => 'تنسيق الوقت:',
	'custom' => 'مخصص',
	'utc_time' => 'التوقيت العالمي هو:',
	'server_time' => 'التوقيت المحلي هو:',
	'date_time_doc' => 'توثيق عن تنسيق التاريخ والوقت.',

	'logo' => 'الشعار:',
	'logo_width' => 'عرض الشعار:',
	'mobile_logo' => 'شعار الموبايل:',
	'mobile_logo_width' => 'عرض شعار الموبايل:',
	'main_color' => 'اللون الاساسي:',
	'main_color_hover' => 'اللون الاساسي (تمرير):',
	'boxes_color' => 'لون الصناديق:',
	'bg_color' => 'لون الخلفية:',
	'active_bg_color' => 'لون الخلفية (مفعل):',
	'badge_color' => 'لون الشارة:',
	'text_color' => 'لون الخط:',

	'dark_logo' => 'الشعار (مظلم):',
	'dark_mobile_logo' => 'شعار الموبايل (مظلم):',
	'dark_main_color' => 'اللون الاساسي (مظلم):',
	'dark_main_color_hover' => 'اللون الاساسي (تمرير) (مظلم):',
	'dark_boxes_color' => 'لون الصناديق (مظلم):',
	'dark_bg_color' => 'لون الخلفية (مظلم):',
	'dark_active_bg_color' => 'لون الخلفية (مفعل) (مظلم):',
	'dark_badge_color' => 'لون الشارة (مظلم):',
	'dark_text_color' => 'لون الخط (مظلم):',

	'country' => 'البلد:',
	'select_country' => '-- اختر البلد --',
	'state' => 'المحافظة/المقاطعة:',
	'city' => 'المدينة:',
	'address' => [
		1 => [
			'title' => 'العنوان 1:',
			'placeholder' => 'اسم الشارع ورقم المنزل',
		],
		2 => [
			'title' => 'العنوان 2:',
			'placeholder' => 'شقة، جناح، وحدة الخ (اختياري)',
		]
	],
	'postcode' => 'الرمز البريدي:',

	'allow_reviews' => [
		'title' => 'السماح بالمراجعات؟',
		'tooltip' => 'حدد هذا إذا كنت تريد السماح بالمراجعات في متجرك.'
	],
	'allow_geust_reviews' => 'السماح بمراجعة الزوار؟',
	'allow_geust_checkout' => [
		'title' => 'السماح للزوار بالشراء؟',
		'tooltip' => 'حدد هذا إذا كنت تريد للزوار الشراء دون إنشاء حساب.'
	],
	'active_wishlist' => 'تفعيل قائمة الأمنيات؟',
	'active_compare' => 'تفعيل المقارنة؟',
	'allow_out_of_stock' => [
		'title' => 'عرض المنتجات غير المتوفرة؟',
		'tooltip' => 'حدد هذا إذا كنت تريد الاستمرار في عرض المنتجات غير المتوفرة في المخزون.'
	],
	'enable_social_share' => 'تمكين المشاركة الاجتماعية؟',
	'enable_share_on' => 'تمكين المشاركة على:',

	'active_recently_viewed' => [
		'title' => 'تفعيل تم عرضه مؤخرًا؟',
		'tooltip' => 'حدد هذا إذا كنت تريد إظهار قسم: تم عرضه مؤخرًا.',
	],
	'active_recommendations' => [
		'title' => 'تفعيل التوصيات؟',
		'tooltip' => 'حدد هذا إذا كنت تريد عرض قسم التوصيات في صفحة الشكر.'
	],
];
